{   

    "1": {
        "title": "Heal - QDR Bridge",
        "description" : "Web platform developed as part of work at OSPO for QDR at Syracuse University. QDR is a dedicated archive for storing and sharing qualitative and mixed-method research data. It hosts variety of collections one of them being HEAL",
        "lineone": "Worked to develop a automated pipeline between to transfer study-level metadata from HEAL and QDR",
        "lastone": "Involved extension JSON structure validation and transformation followed by API calls to upload data to dataverse (backend used by QDR)",
        "technologies": ["tabler:json", "material-icon-theme:javascript", "devicon:bootstrap"],
        "image": "/heal_qdr.PNG",
        "github" : "https://github.com/QualitativeDataRepository/heal-qdr-bridge-UI",
        "url": "https://qualitativedatarepository.github.io/heal-qdr-bridge-UI/"
    },
    "2": {
        "title": "SU Data Storage Finder",
        "description" : "This is a tool I developed as part of development at OSPO for Syracuse University. It aims to help faculty and students find the most appropriate data storage option based on their specific needs using a simple survey method.",
        "lineone": "This tool is built on WordPress as the content management system, featuring a custom-written plugin that renders the user interface thoroughly tested for functionality, responsive design and accessibility testing using WAVE",
        "lastone": "",
        "technologies": ["skill-icons:wordpress", "devicon:php", "vscode-icons:file-type-plsql"],
        "image": "/ospo.png",
        "github" : "https://github.com/SyracuseUniversity/data-storage-finder",
        "url": "https://opensource.syracuse.edu/data-storage-finder/"
    },
    "3": {
        "title": "BookStore POS System",
        "description": "Designed a android mobile application that can help small business owners to setup end-to-end checkout process.",
        "lineone": "Developed backend APIs using Springboot deployed on EC2 to manage retrival and updation of book records. These APIs are called in client side that supports text based and QR code based searching",
        "technologies": ["material-icon-theme:kotlin", "devicon:materialui", "logos:aws-ec2"],
        "image": "/BookstorePOS.png",
        "github" : "https://github.com/kamaljitkaur98/book-store-pos-android-app"
    },
    "4": {
        "title": "Netra",
        "description": "Detect cataracts and classify severity (mild, normal, severe) to improve early detection accuracy.",
        "lineone": "Achieved 96% accuracy in cataract detection using combined SIFT-GLCM features with SVM, Random Forest, and Logistic Regression. SIFT-GLCM individually showed lower accuracies. Attained 97.66% validation accuracy for severity classification using deep convolutional neural network models (SqueezeNet, MobileNet, VGG16).",
        "lastone": "Results accessible via web and Flask-based user interface. Phase 1 implementation published in ICAIAA 2021 conference paper for binary cataract classification.",
        "technologies": ["material-icon-theme:python", "devicon:opencv-wordmark", "devicon:scikitlearn", "devicon:tensorflow"],
        "image": "/cataract.PNG",
        "github" : "https://github.com/kamaljitkaur98/Cataract-Detection-and-Classification"
    },
    "5" : {
        "title": "AgriConnect",
        "description" : "The primary objective was to design a system that significantly reduces manual efforts by automating various processes related to farming.",
        "lineone": "Established sensor network within the farm premises, powered by Raspberry Pi, to monitor critical physical parameters including smoke, temperature, humidity, and moisture. This data is meticulously analyzed on cloud platforms to construct a predictive model for accurate weather forecasting. Additionally, camera-based surveillance is implemented to monitor and detect any trespassing incidents on the farm.",
        "lastone": "The outcomes and insights derived from these monitoring systems are conveniently accessible through a Flask-based GUI",
        "technologies": ["devicon:raspberrypi", "material-icon-theme:python", "devicon:scikitlearn"],
        "image" : "/smartfarm.PNG",
        "github" : "https://github.com/kamaljitkaur98/IoT-based-Smart-Farming-using-Machine-learning"
    },
    "6" : {
        "title" : "FilmFlix Database",
        "description": "To create web application leveraging the open source API to provide users with a seamless search experience for movies and TV series.",
        "lineone": "Using React, a user-friendly interface was crafted, enabling users to easily search, filter, and access detailed information about various titles. Redux was integrated to manage the application's state efficiently, ensuring smooth data flow and responsiveness.",
        "lastone": "The resulting web application offers users a streamlined experience for browsing movies and TV series. With Redux handling the state management, the application maintains performance and states.",
        "technologies": ["skill-icons:react-dark", "skill-icons:redux", "devicon:reactbootstrap", "skill-icons:git"],
        "image" : "/movie.PNG",
        "github" :"https://github.com/kamaljitkaur98/movie-search-web-application",
        "url": "https://movie-search-web-application-kamaljitkaur98.vercel.app/#/"
    },
    "7": {
        "title": "RAIT AdmitBot",
        "description" : "An integrated Chatbot on platforms such as WhatsApp and Telegram. This Chatbot serves as a comprehensive tool to address admission-related inquiries without necessitating a physical visit to the college.",
        "lineone": "System developed using Google Dialogflow with knowledge base collected with the help of Faculty members at undergraduate Institute.",
        "lastone": "This idea was further copyrighted by faculty at the Department of Information Technology so as to scale for the university in the coming years.",
        "technologies": ["logos:dialogflow", "material-icon-theme:python"],
        "image": "/chatbot.PNG",
        "url" : "http://t.me/rait_admission_bot"
    }
}